text = """
=========================================
🔹[[0]*3]*3의 동작

(1) [0]*3 => temp = [0, 0, 0] 
(2) temp * 3 => [temp, temp, temp]

파이썬에서 리스트를 *3 하면 객체를 3개 새로 만드는 게 아니라, 참조를 3번 반복
"""
print(text)

new = [[0]*3]*3
for row in new:
    print(f"{row} - {id(row)}")

text = """
=========================================
🔹[[0]*3 for _ in range(3)] 의 동작

for 루프가 3번 돌 때마다 새로운 리스트 객체를 각각 생성

new = [
    [0,0,0],   # A (객체1)
    [0,0,0],   # B (객체2)
    [0,0,0]    # C (객체3)
]
"""
print(text)
new = [[0]*3 for _ in range(3)]
for row in new:
    print(f"{row} - {id(row)}")


text = """
=========================================
🧩 연습문제: 행렬을 곱한 후 전치 행렬


루틴:
1. 두 행렬을 곱한다
2. 1에서 얻은 행렬을 전치한다
"""
print(text)
A = [
[1,2,3],
[4,5,6],
[7,8,9]
]
B = [
[9,8,7],
[6,5,4],
[3,2,1]
]

# 1. 두 행렬을 곱한다
new = [[0 for _ in range(3)] for _ in range(3)]
for i in range(3):
    for j in range(3):
        for k in range(3):
            new[i][j] += A[i][k] * B[k][j]

# 2. 위에서 얻은 행렬을 전치한다

answer = [[0 for _ in range(3)] for _ in range(3)]

for i in range(3):
    for j in range(3):
        answer[i][j] = new[j][i]
print(answer)
