text = """
=========================================
조합의 경우의 수 - 순서대로, 순서와 상관없이 

(0~n)번째에 올 수 있는 경우의 수, 

🔹 factorial 함수 
🔹 math@comb(총 갯수, 뽑을 경우의 수)
=========================================
"""
print(text)

# (1) 10명을 순서를 정해 줄 세우는 경우의 수
r = 1
for i in range(1, 11):
    r *= i
print(r)

# (2) 10명에서 3명을 뽑아서 순서를 고려해서 나열
def factorial(n):
    r = 1
    for i in range(1, n + 1):
        r *= i
    return r

print(factorial(10) // factorial(7))

# (3) 순서관계 없이 10명 중 3명을 뽑는 경우의 수
print(factorial(10) // (factorial(3) * factorial(7)))

from math import comb
print(comb(10, 3))

text = """
=========================================
🧩 두 개 뽑아서 더하기 
"""
print(text)

"""
numbers = [2,3,4,1,5]

1. 배열에서 두 수를 선택하고 더한다
2. 1에서 구한 수를 새로운 배열에 저장 후 중복값 제거
3. 배열을 오름차순으로 정렬 후 반환

"""
numbers = [2,3,4,1,5]
ret = []
for i in range(len(numbers)):
    for j in range(i + 1, len(numbers)):
        ret.append(numbers[i] + numbers[j])

print(sorted(set(ret)))
