text = """
=========================================
조합의 경우의 수 - 순서대로, 순서와 상관없이 

(0~n)번째에 올 수 있는 경우의 수, 

🔹 factorial 함수 
🔹 math@comb(총 갯수, 뽑을 경우의 수)
=========================================
"""
print(text)

# 10명을 순서를 정해 줄 세우는 경우의 수
r = 1
for i in range(1, 11):
    r *= i
print(r)

# 10명에서 3명을 뽑아서 순서를 고려해서 나열
def factorial(n):
    r = 1
    for i in range(1, n + 1):
        r *= i
    return r

print(factorial(10) // factorial(7))

# 순서관계 없이 10명 중 3명을 뽑는 경우의 수
print(factorial(10) // (factorial(3) * factorial(7)))

from math import comb
print(comb(10, 3))